export default {
  _regexp_cell_phone: /^1[3|4|5|7|8|9]\d{9}$/, // 手机号验证
  _regexp_card_id: /^\d{6}(18|19|20)?\d{2}(0[1-9]|1[012])(0[1-9]|[12]\d|3[01])\d{3}(\d|[xX])$/, // 身份证号验证
  _regexp_password: /^(?!\D+$)(?![^a-zA-Z]+$).{6,30}$/, // 6-30为数字与字母的组合
  _regexp_email: /^(([^<>()\[\]\\.,;:\s@"]+(\.[^<>()\[\]\\.,;:\s@"]+)*)|(".+"))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\])|(([a-zA-Z\-0-9]+\.)+[a-zA-Z]{2,}))$/, // 邮箱验证
  _regexp_lang_zh_cn: /[\u4E00-\u9FA5\uF900-\uFA2D]/, // 中文
  _regexp_hostel_name: /[^\s*$]{2,30}$/,
  _regexp_zh: /^[\u4e00-\u9fa5]{0,}$/, // 汉字
}